iDocs/Base/Data/Requests/TaskListBlockRequest.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <ServiceContext xmlns="http://context.core.datamodel.fs.documentum.emc.com/" token="#TOKEN#">
            <Identities xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
                password="#PASSWORD#" 
                repositoryName="#REPOSITORY#" 
                userName="#USERNAME#" 
                xsi:type="RepositoryIdentity">
            </Identities>
        </ServiceContext>
    </S:Header>
    <S:Body>
        <ns1:getMyTasks xmlns:ns1="http://ws.services.dfs.dms.korusconsulting.ru/">
            <taskType>#BLOCK_NAME#</taskType>
        </ns1:getMyTasks>
    </S:Body>
</S:Envelope>